<center><h1> Pandas-2 </h1></center>
Name: Ngo Thi Minh Thu

Email: ngothiminhthu02@gmail.com

Sorting and Ranking
Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [6]:
import numpy as np
import pandas as pd

In [7]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [8]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [11]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [10]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [12]:
 frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending
order, too:

In [13]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [14]:
 obj = pd.Series([4, 7, -3, 2])

In [15]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [17]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the by option of sort_values:

In [18]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [19]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

To sort by multiple columns, pass a list of names:

In [20]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank:

In [21]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [22]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [23]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

You can rank in descending order, too:

In [25]:
 obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

1 Handling Missing Data
Missing data occurs commonly in many data analysis applications. One of the goals
of pandas is to make working with missing data as painless as possible. For example,
all of the descriptive statistics on pandas objects exclude missing data by default.
The way that missing data is represented in pandas objects is somewhat imperfect,
but it is functional for a lot of users. For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data. We call this a sentinel value that
can be easily detected:

In [26]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [27]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In statistics applications,
NA data may either be data that does not exist or that exists but was not observed
(through problems with data collection, for example). When cleaning up data for
analysis, it is often important to do analysis on the missing data itself to identify data
collection problems or potential biases in the data caused by missing data.

## Filtering Out Missing Data
There are a few ways to filter out missing data. While you always have the option to
do it by hand using pandas.isnull and boolean indexing, the dropna can be helpful.
On a Series, it returns the Series with only the non-null data and index values:

In [29]:
from numpy import nan as NA

In [31]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [32]:
 data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [34]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [35]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
cleaned = data.dropna()

In [37]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA

In [38]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass axis=1:

In [39]:
data[4] = NA

In [40]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [41]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

A related way to filter out DataFrame rows tends to concern time series data. Suppose
you want to keep only rows containing a certain number of observations. You can
indicate this with the thresh argument:

In [43]:
df = pd.DataFrame(np.random.randn(7,3))

In [44]:
df

          0         1         2
0  0.113493  2.215263  1.528032
1 -0.932398 -2.222542  0.108864
2 -1.621045  2.392211 -2.220936
3  2.058312 -0.423653 -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

In [47]:
df.iloc[:4,1] = NA

In [48]:
df.iloc[:2,2] = NA

In [49]:
df

          0         1         2
0  0.113493       NaN       NaN
1 -0.932398       NaN       NaN
2 -1.621045       NaN -2.220936
3  2.058312       NaN -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

In [50]:
df.dropna()

          0         1         2
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

In [56]:
df.dropna(thresh=2)

          0         1         2
2 -1.621045       NaN -2.220936
3  2.058312       NaN -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

## Filling In Missing Data
Rather than filtering out missing data (and potentially discarding other data along
with it), you may want to fill in the “holes” in any number of ways. For most pur‐
poses, the fillna method is the workhorse function to use. Calling fillna with a
constant replaces missing values with that value:

In [57]:
df.fillna(0)

          0         1         2
0  0.113493  0.000000  0.000000
1 -0.932398  0.000000  0.000000
2 -1.621045  0.000000 -2.220936
3  2.058312  0.000000 -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

Calling fillna with a dict, you can use a different fill value for each column:

In [59]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.113493  0.500000  0.000000
1 -0.932398  0.500000  0.000000
2 -1.621045  0.500000 -2.220936
3  2.058312  0.500000 -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

fillna returns a new object, but you can modify the existing object in-place:

In [60]:
 _ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.113493  0.000000  0.000000
1 -0.932398  0.000000  0.000000
2 -1.621045  0.000000 -2.220936
3  2.058312  0.000000 -0.249298
4 -0.065265  0.810352  0.025925
5 -0.571540  0.658970 -0.910960
6  2.362397  1.472749 -1.593962

In [65]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.217246  0.542228 -0.249379
1  0.399683 -1.071780  0.564467
2  0.146219       NaN -0.311348
3 -0.835280       NaN  0.735040
4 -0.807413       NaN       NaN
5 -0.677515       NaN       NaN

In [66]:
df.fillna(method='ffill')

          0         1         2
0 -1.217246  0.542228 -0.249379
1  0.399683 -1.071780  0.564467
2  0.146219 -1.071780 -0.311348
3 -0.835280 -1.071780  0.735040
4 -0.807413 -1.071780  0.735040
5 -0.677515 -1.071780  0.735040

In [67]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.217246  0.542228 -0.249379
1  0.399683 -1.071780  0.564467
2  0.146219 -1.071780 -0.311348
3 -0.835280 -1.071780  0.735040
4 -0.807413       NaN  0.735040
5 -0.677515       NaN  0.735040

In [70]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 2 Data Transformation
### Removing Duplicates
Duplicate rows may be found in a DataFrame for any number of reasons. Here is an
example:

In [71]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [72]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [73]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Both of these methods by default consider all of the columns; alternatively, you can
specify any subset of them to detect duplicates. Suppose we had an additional column
of values and wanted to filter duplicates only based on the 'k1' column:

In [74]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [75]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated and drop_duplicates by default keep the first observed value combina‐
tion. Passing keep='last' will return the last one:

In [76]:
 data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Detecting and Filtering Outliers
Filtering or transforming outliers is largely a matter of applying array operations.
Consider a DataFrame with some normally distributed data:

In [87]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.037824     0.016314    -0.057209    -0.015119
std       0.994177     1.024560     0.976636     1.007662
min      -3.438366    -3.572975    -3.034960    -3.364243
25%      -0.721828    -0.684662    -0.713058    -0.702952
50%      -0.025717    -0.034547    -0.066745    -0.013233
75%       0.635838     0.719416     0.634855     0.690127
max       3.084794     3.392692     3.367465     2.806059

In [88]:
 col = data[2]

In [89]:
col[np.abs(col) > 3]

531   -3.034960
914    3.367465
Name: 2, dtype: float64

To select all rows having a value exceeding 3 or –3, you can use the any method on a
boolean DataFrame

In [90]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
88  -3.250235  0.027347 -0.458335  0.509014
251 -0.097308  0.201091  1.071187 -3.364243
260  0.958535  3.282725 -0.811230 -0.259871
419  3.084794  1.079042  0.080300 -0.263405
531 -0.714387 -0.756509 -3.034960  0.487932
707  0.239447  3.073677 -0.511729  1.154786
780  0.680820  3.392692 -0.358795 -1.129434
789 -0.568931 -0.225882  1.755787 -3.305781
793  1.153458 -0.284992 -1.119138 -3.056236
829 -3.438366 -0.752153 -0.866231  0.808945
902 -0.308243  3.084061 -0.179379  1.218391
914 -1.696622 -1.144840  3.367465 -2.320999
964 -0.537603 -3.572975 -0.657130 -0.697305

Values can be set based on these criteria. Here is code to cap values outside the inter‐
val –3 to 3:

In [91]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.037220     0.016054    -0.057541    -0.014393
std       0.991729     1.020152     0.975308     1.005392
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.721828    -0.684662    -0.713058    -0.702952
50%      -0.025717    -0.034547    -0.066745    -0.013233
75%       0.635838     0.719416     0.634855     0.690127
max       3.000000     3.000000     3.000000     2.806059

The statement np.sign(data) produces 1 and –1 values based on whether the values
in data are positive or negative:

In [92]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0  1.0

## Combining and Merging Datasets
Data contained in pandas objects can be combined together in a number of ways:
- pandas.merge connects rows in DataFrames based on one or more keys. This
will be familiar to users of SQL or other relational databases, as it implements
database join operations.
- pandas.concat concatenates or “stacks” together objects along an axis.
- The combine_first instance method enables splicing together overlapping data
to fill in missing values in one object with values from another.
I will address each of these and give a number of examples. They’ll be utilized in
examples throughout the rest of the book.

### Database-Style DataFrame Joins
Merge or join operations combine datasets by linking rows using one or more keys.
These operations are central to relational databases (e.g., SQL-based). The merge
function in pandas is the main entry point for using these algorithms on your data.

In [95]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [96]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [97]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Note that I didn’t specify which column to join on. If that information is not speci‐
fied, merge uses the overlapping column names as the keys. It’s a good practice to
specify explicitly, though:

In [98]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

If the column names are different in each object, you can specify them separately:

In [100]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [101]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [102]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables. Other possible options are 'left',
'right', and 'outer'. The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [103]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

Many-to-many merges have well-defined, though not necessarily intuitive, behavior.
Here’s an example:

In [104]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [105]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [106]:
 pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

### Merging on Index
In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass left_index=True or right_index=True (or both) to indicate that
the index should be used as the merge key:

In [107]:
 left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [108]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [109]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [110]:
 pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

With hierarchically indexed data, things are more complicated, as joining on index is
implicitly a multiple-key merge:

In [112]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

In [113]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [116]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                       columns=['event1', 'event2'])

In [117]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [118]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [119]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

### Concatenating Along an Axis

Another kind of data combination operation is referred to interchangeably as concat‐
enation, binding, or stacking. NumPy’s concatenate function can do this with
NumPy arrays:

In [120]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [121]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [122]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [123]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [124]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [125]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In this case there is no overlap on the other axis, which as you can see is the sorted
union (the 'outer' join) of the indexes. You can instead intersect them by passing
join='inner':

In [126]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [127]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [128]:
 pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

A potential issue is that the concatenated pieces are not identifiable in the result. Sup‐
pose instead you wanted to create a hierarchical index on the concatenation axis. To
do this, use the keys argument:

In [130]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [131]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [132]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In the case of combining Series along axis=1, the keys become the DataFrame col‐
umn headers:

In [133]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

The same logic extends to DataFrame objects:

In [134]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['three', 'four'])

In [135]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [136]:
df2

   three  four
a      5     6
c      7     8

In [137]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [138]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [139]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

A last consideration concerns DataFrames in which the row index does not contain
any relevant data:

In [140]:
pd.concat([df1, df2], ignore_index=True)

   one  two  three  four
0  0.0  1.0    NaN   NaN
1  2.0  3.0    NaN   NaN
2  4.0  5.0    NaN   NaN
3  NaN  NaN    5.0   6.0
4  NaN  NaN    7.0   8.0

### Grouping with Dicts and Series
Grouping information may exist in a form other than an array. Let’s consider another
example DataFrame:

In [141]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [142]:
people

               a         b         c         d         e
Joe    -0.354413  1.046353  0.088469  0.408000 -0.694324
Steve  -0.360287  0.039465  1.110861 -0.727109 -0.108538
Wes    -0.564558  0.660821 -0.356263  1.253065  0.758181
Jim     0.140168  1.309125  2.402106  0.059812  0.113742
Travis  0.979321  0.249412  0.610703  0.587427 -0.583001

In [144]:
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe    -0.354413  1.046353  0.088469  0.408000 -0.694324
Steve  -0.360287  0.039465  1.110861 -0.727109 -0.108538
Wes    -0.564558       NaN       NaN  1.253065  0.758181
Jim     0.140168  1.309125  2.402106  0.059812  0.113742
Travis  0.979321  0.249412  0.610703  0.587427 -0.583001

Now, suppose I have a group correspondence for the columns and want to sum
together the columns by group:

In [145]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
            'd': 'blue', 'e': 'red', 'f' : 'orange'}

Now, you could construct an array from this dict to pass to groupby, but instead we
can just pass the dict (I included the key 'f' to highlight that unused grouping keys
are OK):

In [147]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     0.496469 -0.002384
Steve   0.383752 -0.429360
Wes     1.253065  0.193622
Jim     2.461918  1.563036
Travis  1.198131  0.645732

The same functmionality holds for Series, which can be viewed as a fixed-size mapping:

In [150]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [151]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### Grouping with Functions
Using Python functions is a more generic way of defining a group mapping compared
with a dict or Series. Any function passed as a group key will be called once per index
value, with the return values being used as the group names. More concretely, con‐
sider the example DataFrame from the previous section, which has people’s first
names as index values. Suppose you wanted to group by the length of the names;
while you could compute an array of string lengths, it’s simpler to just pass the len
function:

In [152]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.778803  2.355478  2.490575  1.720876  0.177599
5 -0.360287  0.039465  1.110861 -0.727109 -0.108538
6  0.979321  0.249412  0.610703  0.587427 -0.583001

Mixing functions with arrays, dicts, or Series is not a problem as everything gets con‐
verted to arrays internally:

In [153]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.564558  1.046353  0.088469  0.408000 -0.694324
  two  0.140168  1.309125  2.402106  0.059812  0.113742
5 one -0.360287  0.039465  1.110861 -0.727109 -0.108538
6 two  0.979321  0.249412  0.610703  0.587427 -0.583001

### Grouping by Index Levels

In [154]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [156]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [157]:
 hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.683724 -0.121354 -2.433277  0.966857  1.227850
1     -0.159653  1.019845 -1.246091  1.350801  1.316642
2     -0.130363  0.172986  0.626290 -0.318880 -0.807035
3      1.216622 -0.181452 -0.520141 -0.498559 -0.808039

In [158]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3